klausgollmer/IoT-Werkstatt-IoTW-Bundle/arduino/portable/packages/esp32/hardware/esp32/3.3.2/boards.txt
##############################################################

esp32h2.name=ESP32H2 Dev Module
esp32h2.hide=true

esp32h2.bootloader.tool=esptool_py
esp32h2.bootloader.tool.default=esptool_py

esp32h2.upload.tool=esptool_py
esp32h2.upload.tool.default=esptool_py
esp32h2.upload.tool.network=esp_ota

esp32h2.upload.maximum_size=1310720
esp32h2.upload.maximum_data_size=327680
esp32h2.upload.flags=
esp32h2.upload.extra_flags=
esp32h2.upload.use_1200bps_touch=false
esp32h2.upload.wait_for_upload_port=false

esp32h2.serial.disableDTR=false
esp32h2.serial.disableRTS=false

esp32h2.build.tarch=riscv32
esp32h2.build.target=esp
esp32h2.build.mcu=esp32h2
esp32h2.build.core=esp32
esp32h2.build.variant=esp32h2
esp32h2.build.board=ESP32H2_DEV
esp32h2.build.bootloader_addr=0x0

esp32h2.build.cdc_on_boot=0
esp32h2.build.f_cpu=96000000L
esp32h2.build.flash_size=4MB
esp32h2.build.flash_freq=64m
esp32h2.build.img_freq=48m
esp32h2.build.flash_mode=qio
esp32h2.build.boot=qio
esp32h2.build.partitions=default
esp32h2.build.defines=

## IDE 2.0 Seems to not update the value
esp32h2.menu.JTAGAdapter.default=Disabled
esp32h2.menu.JTAGAdapter.default.build.copy_jtag_files=0
esp32h2.menu.JTAGAdapter.builtin=Integrated USB JTAG
esp32h2.menu.JTAGAdapter.builtin.build.openocdscript=esp32h2-builtin.cfg
esp32h2.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
esp32h2.menu.JTAGAdapter.external=FTDI Adapter
esp32h2.menu.JTAGAdapter.external.build.openocdscript=esp32h2-ftdi.cfg
esp32h2.menu.JTAGAdapter.external.build.copy_jtag_files=1
esp32h2.menu.JTAGAdapter.bridge=ESP USB Bridge
esp32h2.menu.JTAGAdapter.bridge.build.openocdscript=esp32h2-bridge.cfg
esp32h2.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

esp32h2.menu.CDCOnBoot.default=Disabled
esp32h2.menu.CDCOnBoot.default.build.cdc_on_boot=0
esp32h2.menu.CDCOnBoot.cdc=Enabled
esp32h2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

esp32h2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32h2.menu.PartitionScheme.default.build.partitions=default
esp32h2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32h2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32h2.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
esp32h2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
esp32h2.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
esp32h2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
esp32h2.menu.PartitionScheme.minimal.build.partitions=minimal
esp32h2.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
esp32h2.menu.PartitionScheme.no_fs.build.partitions=no_fs
esp32h2.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
esp32h2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32h2.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32h2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32h2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32h2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32h2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32h2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32h2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32h2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32h2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32h2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32h2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
esp32h2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32h2.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32h2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32h2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
esp32h2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32h2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32h2.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
esp32h2.menu.PartitionScheme.fatflash.build.partitions=ffat
esp32h2.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
esp32h2.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
esp32h2.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
esp32h2.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
#esp32h2.menu.PartitionScheme.rainmaker=RainMaker 4MB
#esp32h2.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
#esp32h2.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
#esp32h2.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
#esp32h2.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
#esp32h2.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
#esp32h2.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
#esp32h2.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
#esp32h2.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4116480
esp32h2.menu.PartitionScheme.zigbee=Zigbee 4MB with spiffs
esp32h2.menu.PartitionScheme.zigbee.build.partitions=zigbee
esp32h2.menu.PartitionScheme.zigbee.upload.maximum_size=1310720
esp32h2.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
esp32h2.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
esp32h2.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
esp32h2.menu.PartitionScheme.custom=Custom
esp32h2.menu.PartitionScheme.custom.build.partitions=
esp32h2.menu.PartitionScheme.custom.upload.maximum_size=16777216

esp32h2.menu.FlashMode.qio=QIO
esp32h2.menu.FlashMode.qio.build.flash_mode=dio
esp32h2.menu.FlashMode.qio.build.boot=qio
esp32h2.menu.FlashMode.dio=DIO
esp32h2.menu.FlashMode.dio.build.flash_mode=dio
esp32h2.menu.FlashMode.dio.build.boot=dio

esp32h2.menu.FlashFreq.64=64MHz
esp32h2.menu.FlashFreq.64.build.flash_freq=64m
esp32h2.menu.FlashFreq.64.build.img_freq=48m
#esp32h2.menu.FlashFreq.32=32MHz
#esp32h2.menu.FlashFreq.32.build.flash_freq=32m
#esp32h2.menu.FlashFreq.32.build.img_freq=24m
esp32h2.menu.FlashFreq.16=16MHz
esp32h2.menu.FlashFreq.16.build.flash_freq=16m
esp32h2.menu.FlashFreq.16.build.img_freq=12m

esp32h2.menu.FlashSize.4M=4MB (32Mb)
esp32h2.menu.FlashSize.4M.build.flash_size=4MB
esp32h2.menu.FlashSize.8M=8MB (64Mb)
esp32h2.menu.FlashSize.8M.build.flash_size=8MB
esp32h2.menu.FlashSize.2M=2MB (16Mb)
esp32h2.menu.FlashSize.2M.build.flash_size=2MB
esp32h2.menu.FlashSize.16M=16MB (128Mb)
esp32h2.menu.FlashSize.16M.build.flash_size=16MB

esp32h2.menu.UploadSpeed.921600=921600
esp32h2.menu.UploadSpeed.921600.upload.speed=921600
esp32h2.menu.UploadSpeed.115200=115200
esp32h2.menu.UploadSpeed.115200.upload.speed=115200
esp32h2.menu.UploadSpeed.256000.windows=256000
esp32h2.menu.UploadSpeed.256000.upload.speed=256000
esp32h2.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32h2.menu.UploadSpeed.230400=230400
esp32h2.menu.UploadSpeed.230400.upload.speed=230400
esp32h2.menu.UploadSpeed.460800.linux=460800
esp32h2.menu.UploadSpeed.460800.macosx=460800
esp32h2.menu.UploadSpeed.460800.upload.speed=460800
esp32h2.menu.UploadSpeed.512000.windows=512000
esp32h2.menu.UploadSpeed.512000.upload.speed=512000

esp32h2.menu.DebugLevel.none=None
esp32h2.menu.DebugLevel.none.build.code_debug=0
esp32h2.menu.DebugLevel.error=Error
esp32h2.menu.DebugLevel.error.build.code_debug=1
esp32h2.menu.DebugLevel.warn=Warn
esp32h2.menu.DebugLevel.warn.build.code_debug=2
esp32h2.menu.DebugLevel.info=Info
esp32h2.menu.DebugLevel.info.build.code_debug=3
esp32h2.menu.DebugLevel.debug=Debug
esp32h2.menu.DebugLevel.debug.build.code_debug=4
esp32h2.menu.DebugLevel.verbose=Verbose
esp32h2.menu.DebugLevel.verbose.build.code_debug=5

esp32h2.menu.EraseFlash.none=Disabled
esp32h2.menu.EraseFlash.none.upload.erase_cmd=
esp32h2.menu.EraseFlash.all=Enabled
esp32h2.menu.EraseFlash.all.upload.erase_cmd=-e

