klausgollmer/IoT-Werkstatt-IoTW-Bundle/arduino/portable/packages/esp32/hardware/esp32/3.3.2/boards.txt
esp32wrover.menu.EraseFlash.none=Disabled
esp32wrover.menu.EraseFlash.none.upload.erase_cmd=
esp32wrover.menu.EraseFlash.all=Enabled
esp32wrover.menu.EraseFlash.all.upload.erase_cmd=-e



##############################################################

##############################################################

SI-Labs.name=Makey / Octopus Board CP21xx
SI-Labs.build.board=SILABSBOARD_ID
SI-Labs.hide=true
SI-Labs.vid.0=0x10C4
SI-Labs.pid.0=0xEA60

ch340board.name=CH340 Board
ch340board.build.board=CH340BOARD_ID
ch340board.hide=true
# VID/PID aus dem Geräte-Manager: z.B. 0x1A86:0x7523
ch340board.vid.0=0x1A86
ch340board.pid.0=0x7523

ch9102board.name=Makey Board CH9102
ch9102board.build.board=CH340BOARD_ID
ch9102board.hide=true
# VID/PID aus dem Geräte-Manager: z.B. 0x1A86:0x7523
ch9102board.vid.0=0x1A86
ch9102board.pid.0=0x55D4

##############################################################
makey_v1.name=Makey V1
makey_v1.bootloader.tool=esptool_py
makey_v1.bootloader.tool.default=esptool_py

makey_v1.upload.tool=esptool_py
makey_v1.upload.tool.default=esptool_py
makey_v1.upload.tool.network=esp_ota

makey_v1.upload.maximum_size=1310720
makey_v1.upload.maximum_data_size=327680
makey_v1.upload.flags=
makey_v1.upload.extra_flags=

makey_v1.serial.disableDTR=true
makey_v1.serial.disableRTS=true

makey_v1.build.tarch=xtensa
makey_v1.build.bootloader_addr=0x1000
makey_v1.build.target=esp32
makey_v1.build.mcu=esp32
makey_v1.build.core=esp32_pre
makey_v1.build.variant=makey_v1
makey_v1.build.board=D1_MINI32

makey_v1.build.f_cpu=240000000L
makey_v1.build.flash_mode=dio
makey_v1.build.flash_size=4MB
makey_v1.build.boot=dio
makey_v1.build.partitions=default
makey_v1.build.defines=

# Inject-Menü (schaltet Core + Flag)
makey_v1.menu.inject.on=ON (use precompiled core.a)
makey_v1.menu.inject.on.build.core=esp32_pre
makey_v1.menu.inject.on.build.inject_core=1

makey_v1.menu.inject.off=OFF (compile full core)
makey_v1.menu.inject.off.build.core=esp32
makey_v1.menu.inject.off.build.inject_core=0



#makey_v1.menu.FlashFreq.80=80MHz
#makey_v1.menu.FlashFreq.80.build.flash_freq=80m

#makey_v1.menu.PartitionScheme.default=Default
#makey_v1.menu.PartitionScheme.default.build.partitions=default
#makey_v1.menu.CPUFreq.240=240MHz (WiFi/BT)
#makey_v1.menu.CPUFreq.240.build.f_cpu=240000000L

makey_v1.menu.UploadSpeed.921600=921600
makey_v1.menu.UploadSpeed.921600.upload.speed=921600
makey_v1.menu.UploadSpeed.115200=115200
makey_v1.menu.UploadSpeed.115200.upload.speed=115200
makey_v1.menu.UploadSpeed.460800.linux=460800
makey_v1.menu.UploadSpeed.460800.macosx=460800
makey_v1.menu.UploadSpeed.460800.upload.speed=460800
makey_v1.menu.UploadSpeed.1500000=1500000
makey_v1.menu.UploadSpeed.1500000.upload.speed=1500000

#makey_v1.menu.DebugLevel.none=None
#makey_v1.menu.DebugLevel.none.build.code_debug=0

#makey_v1.menu.EraseFlash.none=Disabled
#makey_v1.menu.EraseFlash.none.upload.erase_cmd=
makey_v1.upload.erase_cmd= 


##############################################################

makey_v1b.name=ESP32 / Makey on Battery
#makey_v1b.bootloader.tool=esptool_py
#makey_v1b.bootloader.tool.default=esptool_py

makey_v1b.upload.tool=esptool_py
makey_v1b.upload.tool.default=esptool_py
makey_v1b.upload.tool.network=esp_ota

makey_v1b.upload.maximum_size=1310720
makey_v1b.upload.maximum_data_size=327680
makey_v1b.upload.flags=
makey_v1b.upload.extra_flags=

makey_v1b.serial.disableDTR=true
makey_v1b.serial.disableRTS=true

makey_v1b.build.tarch=xtensa
makey_v1b.build.bootloader_addr=0x1000
makey_v1b.build.target=esp32
makey_v1b.build.mcu=esp32
makey_v1b.build.core=esp32
makey_v1b.build.variant=makey_v1b
makey_v1b.build.board=D1_MINI32

makey_v1b.build.flash_mode=dio
makey_v1b.build.flash_size=4MB
makey_v1b.build.boot=dio
makey_v1b.build.partitions=default
makey_v1b.build.defines=

#makey_v1b.menu.FlashFreq.80=80MHz
#makey_v1b.menu.FlashFreq.80.build.flash_freq=80m

#makey_v1b.menu.PartitionScheme.default=Default
#makey_v1b.menu.PartitionScheme.default.build.partitions=default

makey_v1b.build.f_cpu=10000000L
makey_v1b.menu.CPUFreq.10=10MHz (40MHz XTAL)
makey_v1b.menu.CPUFreq.10.build.f_cpu=10000000L
makey_v1b.menu.CPUFreq.10.default=true
makey_v1b.menu.CPUFreq.80=80MHz (WiFi/BT)
makey_v1b.menu.CPUFreq.80.build.f_cpu=80000000L

makey_v1b.menu.UploadSpeed.921600=921600
makey_v1b.menu.UploadSpeed.921600.upload.speed=921600
makey_v1b.menu.UploadSpeed.115200=115200
makey_v1b.menu.UploadSpeed.115200.upload.speed=115200
makey_v1b.menu.UploadSpeed.460800.linux=460800
makey_v1b.menu.UploadSpeed.460800.macosx=460800
makey_v1b.menu.UploadSpeed.460800.upload.speed=460800

#makey_v1b.menu.DebugLevel.none=None
#makey_v1b.menu.DebugLevel.none.build.code_debug=0

#makey_v1b.menu.EraseFlash.none=Disabled
#makey_v1b.menu.EraseFlash.none.upload.erase_cmd=
makey_v1b.upload.erase_cmd= 


##############################################################
IoTW_Lab32.name=IoTW Lab Custom
IoTW_Lab32.bootloader.tool=esptool_py
IoTW_Lab32.bootloader.tool.default=esptool_py

IoTW_Lab32.upload.tool=esptool_py
IoTW_Lab32.upload.tool.default=esptool_py
IoTW_Lab32.upload.tool.network=esp_ota

IoTW_Lab32.upload.maximum_size=1310720
IoTW_Lab32.upload.maximum_data_size=327680
IoTW_Lab32.upload.flags=
IoTW_Lab32.upload.extra_flags=

IoTW_Lab32.serial.disableDTR=true
IoTW_Lab32.serial.disableRTS=true

IoTW_Lab32.build.tarch=xtensa
IoTW_Lab32.build.bootloader_addr=0x1000
IoTW_Lab32.build.target=esp32
IoTW_Lab32.build.mcu=esp32
IoTW_Lab32.build.core=esp32_pre
IoTW_Lab32.build.variant=makey_v1
IoTW_Lab32.build.board=D1_MINI32

IoTW_Lab32.build.f_cpu=240000000L
IoTW_Lab32.build.flash_mode=dio
IoTW_Lab32.build.flash_size=4MB
IoTW_Lab32.build.boot=dio
IoTW_Lab32.build.partitions=default
IoTW_Lab32.build.defines=

# Inject-Menü (schaltet Core + Flag)
IoTW_Lab32.menu.inject.on=ON (use precompiled core.a)
IoTW_Lab32.menu.inject.on.build.core=esp32_pre
IoTW_Lab32.menu.inject.on.build.inject_core=1

IoTW_Lab32.menu.inject.off=OFF (compile full core)
IoTW_Lab32.menu.inject.off.build.core=esp32
IoTW_Lab32.menu.inject.off.build.inject_core=0

IoTW_Lab32.menu.UploadSpeed.921600=921600
IoTW_Lab32.menu.UploadSpeed.921600.upload.speed=921600
IoTW_Lab32.menu.UploadSpeed.115200=115200
IoTW_Lab32.menu.UploadSpeed.115200.upload.speed=115200
IoTW_Lab32.menu.UploadSpeed.460800.linux=460800
IoTW_Lab32.menu.UploadSpeed.460800.macosx=460800
IoTW_Lab32.menu.UploadSpeed.460800.upload.speed=460800
IoTW_Lab32.menu.UploadSpeed.1500000=1500000
IoTW_Lab32.menu.UploadSpeed.1500000.upload.speed=1500000
IoTW_Lab32.upload.erase_cmd= 


