klausgollmer/IoT-Werkstatt-IoTW-Bundle/arduino/portable/packages/esp32/hardware/esp32/3.3.2/boards.txt
##############################################################




#############################################################

makey_v0.name=Makey V0
makey_v0.hide=true

makey_v0.bootloader.tool=esptool_py
makey_v0.bootloader.tool.default=esptool_py

makey_v0.upload.tool=esptool_py
makey_v0.upload.tool.default=esptool_py
makey_v0.upload.tool.network=esp_ota

makey_v0.upload.maximum_size=1310720
makey_v0.upload.maximum_data_size=327680
makey_v0.upload.flags=
makey_v0.upload.extra_flags=

makey_v0.serial.disableDTR=true
makey_v0.serial.disableRTS=true

makey_v0.build.tarch=xtensa
makey_v0.build.bootloader_addr=0x1000
makey_v0.build.target=esp32
makey_v0.build.mcu=esp32
makey_v0.build.core=esp32
makey_v0.build.variant=makey_v0
makey_v0.build.board=D1_MINI32

makey_v0.build.f_cpu=240000000L
makey_v0.build.flash_mode=dio
makey_v0.build.flash_size=4MB
makey_v0.build.boot=dio
makey_v0.build.partitions=default
makey_v0.build.defines=
makey_v0.menu.FlashFreq.80=80MHz
makey_v0.menu.FlashFreq.80.build.flash_freq=80m

makey_v0.menu.PartitionScheme.default=Default
makey_v0.menu.PartitionScheme.default.build.partitions=default

makey_v0.menu.CPUFreq.240=240MHz (WiFi/BT)
makey_v0.menu.CPUFreq.240.build.f_cpu=240000000L

makey_v0.menu.UploadSpeed.921600=921600
makey_v0.menu.UploadSpeed.921600.upload.speed=921600
makey_v0.menu.UploadSpeed.115200=115200
makey_v0.menu.UploadSpeed.115200.upload.speed=115200
makey_v0.menu.UploadSpeed.256000.windows=256000
makey_v0.menu.UploadSpeed.256000.upload.speed=256000
makey_v0.menu.UploadSpeed.230400.windows.upload.speed=256000
makey_v0.menu.UploadSpeed.230400=230400
makey_v0.menu.UploadSpeed.230400.upload.speed=230400
makey_v0.menu.UploadSpeed.460800.linux=460800
makey_v0.menu.UploadSpeed.460800.macosx=460800
makey_v0.menu.UploadSpeed.460800.upload.speed=460800
makey_v0.menu.UploadSpeed.512000.windows=512000
makey_v0.menu.UploadSpeed.512000.upload.speed=512000

makey_v0.menu.DebugLevel.none=None
makey_v0.menu.DebugLevel.none.build.code_debug=0

makey_v0.menu.EraseFlash.none=Disabled
makey_v0.menu.EraseFlash.none.upload.erase_cmd=




##############################################################

makey_v1_core_cpp.name=Makey V1 core_cpp
makey_v1_core_cpp.hide=true

makey_v1_core_cpp.bootloader.tool=esptool_py
makey_v1_core_cpp.bootloader.tool.default=esptool_py

makey_v1_core_cpp.upload.tool=esptool_py
makey_v1_core_cpp.upload.tool.default=esptool_py
makey_v1_core_cpp.upload.tool.network=esp_ota

makey_v1_core_cpp.upload.maximum_size=1310720
makey_v1_core_cpp.upload.maximum_data_size=327680
makey_v1_core_cpp.upload.flags=
makey_v1_core_cpp.upload.extra_flags=

makey_v1_core_cpp.serial.disableDTR=true
makey_v1_core_cpp.serial.disableRTS=true

makey_v1_core_cpp.build.tarch=xtensa
makey_v1_core_cpp.build.bootloader_addr=0x1000
makey_v1_core_cpp.build.target=esp32
makey_v1_core_cpp.build.mcu=esp32
makey_v1_core_cpp.build.core=esp32
makey_v1_core_cpp.build.variant=makey_v1
makey_v1_core_cpp.build.board=D1_MINI32

makey_v1_core_cpp.build.f_cpu=240000000L
makey_v1_core_cpp.build.flash_mode=dio
makey_v1_core_cpp.build.flash_size=4MB
makey_v1_core_cpp.build.boot=dio
makey_v1_core_cpp.build.partitions=default
makey_v1_core_cpp.build.defines=
makey_v1_core_cpp.menu.FlashFreq.80=80MHz
makey_v1_core_cpp.menu.FlashFreq.80.build.flash_freq=80m
#makey_v1_core_cpp.menu.FlashFreq.40=40MHz
#makey_v1_core_cpp.menu.FlashFreq.40.build.flash_freq=40m

makey_v1_core_cpp.menu.PartitionScheme.default=Default
makey_v1_core_cpp.menu.PartitionScheme.default.build.partitions=default
#makey_v1_core_cpp.menu.PartitionScheme.no_ota=No OTA (Large APP)
#makey_v1_core_cpp.menu.PartitionScheme.no_ota.build.partitions=no_ota
#makey_v1_core_cpp.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
#makey_v1_core_cpp.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
#makey_v1_core_cpp.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
#makey_v1_core_cpp.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

makey_v1_core_cpp.menu.CPUFreq.240=240MHz (WiFi/BT)
makey_v1_core_cpp.menu.CPUFreq.240.build.f_cpu=240000000L

makey_v1_core_cpp.menu.UploadSpeed.921600=921600
makey_v1_core_cpp.menu.UploadSpeed.921600.upload.speed=921600
makey_v1_core_cpp.menu.UploadSpeed.115200=115200
makey_v1_core_cpp.menu.UploadSpeed.115200.upload.speed=115200
makey_v1_core_cpp.menu.UploadSpeed.460800.linux=460800
makey_v1_core_cpp.menu.UploadSpeed.460800.macosx=460800
makey_v1_core_cpp.menu.UploadSpeed.460800.upload.speed=460800

makey_v1_core_cpp.menu.DebugLevel.none=None
makey_v1_core_cpp.menu.DebugLevel.none.build.code_debug=0

makey_v1_core_cpp.menu.EraseFlash.none=Disabled
makey_v1_core_cpp.menu.EraseFlash.none.upload.erase_cmd=
#makey_v1_core_cpp.menu.EraseFlash.all=Enabled
#makey_v1_core_cpp.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################


ttgo-lora32.name=TTGO LoRa32-OLED
ttgo-lora32.hide=true

ttgo-lora32.bootloader.tool=esptool_py
ttgo-lora32.bootloader.tool.default=esptool_py

ttgo-lora32.upload.tool=esptool_py
ttgo-lora32.upload.tool.default=esptool_py
ttgo-lora32.upload.tool.network=esp_ota

ttgo-lora32.upload.maximum_size=1310720
ttgo-lora32.upload.maximum_data_size=294912
ttgo-lora32.upload.flags=
ttgo-lora32.upload.extra_flags=

ttgo-lora32.serial.disableDTR=true
ttgo-lora32.serial.disableRTS=true

ttgo-lora32.build.tarch=xtensa
ttgo-lora32.build.bootloader_addr=0x1000
ttgo-lora32.build.target=esp32
ttgo-lora32.build.mcu=esp32
ttgo-lora32.build.core=esp32
ttgo-lora32.build.board=TTGO_LoRa32
ttgo-lora32.build.defines=

ttgo-lora32.menu.Revision.TTGO_LoRa32_V1=TTGO LoRa32 V1 (No TFCard)
ttgo-lora32.menu.Revision.TTGO_LoRa32_V1.build.board=TTGO_LoRa32_V1
ttgo-lora32.menu.Revision.TTGO_LoRa32_V1.build.variant=ttgo-lora32-v1

ttgo-lora32.menu.Revision.TTGO_LoRa32_V2=TTGO LoRa32 V2
ttgo-lora32.menu.Revision.TTGO_LoRa32_V2.build.board=TTGO_LoRa32_V2
ttgo-lora32.menu.Revision.TTGO_LoRa32_V2.build.variant=ttgo-lora32-v2

ttgo-lora32.menu.Revision.TTGO_LoRa32_v21new=TTGO LoRa32 V2.1 (1.6.1)
ttgo-lora32.menu.Revision.TTGO_LoRa32_v21new.build.board=TTGO_LoRa32_v21new
ttgo-lora32.menu.Revision.TTGO_LoRa32_v21new.build.variant=ttgo-lora32-v21new

ttgo-lora32.build.f_cpu=240000000L
ttgo-lora32.build.flash_mode=dio
ttgo-lora32.build.flash_size=4MB
ttgo-lora32.build.boot=dio
ttgo-lora32.build.partitions=default

